In [1]:
#  Import libraries

import pandas as pd
import numpy as np

In [5]:
s = pd.Series([3,4,2,np.nan,6,2,5,6,2])
s

0    3.0
1    4.0
2    2.0
3    NaN
4    6.0
5    2.0
6    5.0
7    6.0
8    2.0
dtype: float64

In [10]:
dates = pd.date_range('20001001',periods=12)
dates

DatetimeIndex(['2000-10-01', '2000-10-02', '2000-10-03', '2000-10-04',
               '2000-10-05', '2000-10-06', '2000-10-07', '2000-10-08',
               '2000-10-09', '2000-10-10', '2000-10-11', '2000-10-12'],
              dtype='datetime64[ns]', freq='D')

In [19]:
df =pd.DataFrame(np.random.randn(12,3),index=dates, columns=list('ABC'))
df

                   A         B         C
2000-10-01  0.286526  0.720847  0.426330
2000-10-02  0.311574  1.644477  0.961835
2000-10-03 -0.587984 -1.005390  0.229872
2000-10-04 -1.453575 -0.685845 -0.536107
2000-10-05 -0.929238  0.448794  0.669485
2000-10-06 -1.339824  0.918081  0.151919
2000-10-07  0.614013  0.184718  1.004196
2000-10-08  1.470432 -0.305158  0.626780
2000-10-09  0.795581 -1.391248  0.392629
2000-10-10  0.374500  0.005661  2.112267
2000-10-11 -0.861484 -1.211233  0.645934
2000-10-12  0.029176  0.203541  0.215791

In [31]:
d2 = pd.DataFrame(
{
  'A':'1.0',
  'B':pd.Timestamp(20220209),
  'D':pd.Series(1,index=list(range(4)),dtype="float32"),
  'C':np.array([3]*4,dtype="int32"),
  'E':pd.Categorical(["someone_1","someone_2","someone_3","someone_4",]),
  'F':"fool"
 }
)
d2

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool
2  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_3  fool
3  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_4  fool

In [33]:
print(d2.dtypes)

A            object
B    datetime64[ns]
D           float32
C             int32
E          category
F            object
dtype: object

In [35]:
d2.index

Int64Index([0, 1, 2, 3], dtype='int64')

In [38]:
 d2.describe()

         D    C
count  4.0  4.0
mean   1.0  3.0
std    0.0  0.0
min    1.0  3.0
25%    1.0  3.0
50%    1.0  3.0
75%    1.0  3.0
max    1.0  3.0

In [39]:
d2[0:]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool
2  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_3  fool
3  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_4  fool

In [40]:
d2[0:2]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool

In [45]:
d2.loc[:,["C","D"]]

   C    D
0  3  1.0
1  3  1.0
2  3  1.0
3  3  1.0

In [52]:
d2.loc['20220101':"20220104",["A","C"]]

Empty DataFrame
Columns: [A, C]
Index: []

In [53]:
d2.iloc[0:2,:]

     A                             B    D  C          E     F
0  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_1  fool
1  1.0 1970-01-01 00:00:00.020220209  1.0  3  someone_2  fool

In [55]:
d2.iloc[1:2,:3]

     A                             B    D
1  1.0 1970-01-01 00:00:00.020220209  1.0

In [60]:
df[df['C'] > 1]

                   A         B         C
2000-10-07  0.614013  0.184718  1.004196
2000-10-10  0.374500  0.005661  2.112267